{
  "main": {
    "name": "Kevin Gastelum",
    "occupation": "Developer/Data Analyst aspiring to be a Data Scientist",
    "description": "With experience working with programming languages such as Python, SQL, Javascript, and Lua",
    "image": "profilepic.jpg",
    "bio": "Went to college for Computer Networking and have previous work experience in the field but found a greater passion in learning how to code. I enjoy working with numbers, managing data, problem-solving and have found Data Analysis to be the perfect field to hone my skills in.",

    "email": "Gastelum.A.Kevin@gmail.com",
    "phone": "602-653-3740",
    "address": {
      "street": "1742 W Corona Ave",
      "city": "Phoenix",
      "state": "Arizona",
      "zip": "85041"
    },
    "website": "https://kevin.lovestoblog.com/",
    "resumedownload": "dataanalyst.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/KevinGastelum77",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/kevin-alexis-gastelum-navarrete/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://instagram.com/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/KevinGastelum/",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Short write-up of my skills to show off to employers",
    "education": [
      {
        "school": "Pytorch Deep Learning",
        "degree": "",
        "graduated": "December 2021 - Current",
        "description": "In depth Pytorch course taught by Daniel Bourke covering intro to tensors: tensor datatypes, tensor operations (addition, subtraction, multiplication, division) common tensor errors, tensor aggregation, shaping, stacking, squeezing, unsqueezing and tensor indexing. Overview of data prepping for Pytorch: converting data into tensors. Building a model: hidden layers, hidden neurons, forward pass, loss function, and optimizers. Training a model: creating a train/test loop, using an activation function and optimizing predictions."
      },
      {
        "school": "Self-taught Programmer",
        "degree": "",
        "graduated": "July 2019 - Current",
        "description": "Have not been to a University yet... but I've been able to acquire all of my skills online for free thanks to the internet! I have acquired Math skills such as Geometry, Algebra, Trigonometry, Statistics & Probability and Linear Algebra from websites like Khan Academy, Brilliant and Math trainer. I've also Learned how to code in Python, SQL, and Javascript by following courses on EDX, Coursera and Udemy as well as Youtube channels like FreeCodeCamp, CS Dojo, Python Engineer, Derek Banas, Daniel Bourke, Nicholas Renotte, Mosh, Corey Schafer, Tech with Tim, Clever Programmer, Angela Yu, Academind, and Javascript Mastery."
      },
      {
        "school": "South Mountain Community College",
        "degree": "Network Security",
        "graduated": "2014 - 2018",
        "description": "Specialized in Network Security and Network Servers where I learned Cybersecurity best practices, how to manage and maintain networks and servers. Gained experience troubleshooting and configuring servers in Windows CLI, Linux Bash, Windows Active Directory, VMWare, and Docker containers."
      }
    ],
    "work": [
      {
        "company": "ILG",
        "title": "Data Analyst",
        "years": "May 2022 - Current",
        "description": "Export data batches from SAP containing thousands of rows worth of data into Excel to perform cleaning, sorting, and filtering as well as organizing data by designing formulas and implementing XLookup, Vlookup, Find/Search, Index/Match, Left/Right, Unique, Trim, IFs, SumIFs, CountIFs, IFError, IFNA, and Concatenate functions. Present data in a visually pleasing way by utilizing Pivot Tables, Charts, and Graphs"
      },
      {
        "company": "Apple",
        "title": "Datacenter Technician",
        "years": "February 2018 - March 2019",
        "description": "Built, racked and cabled server enclosers in a neat and timely manner. Worked with Arista, Dell, HP, Sanmina, and Cisco equipment. Provided assistance with break/fix related tasks. Ran fiber cables from endpoints back to switches. Analyze, test, troubleshoot, and evaluate existing network. Performed network maintenance to ensure networks operate correctly with minimal interruption and documented network related activities or tasks."
      },
      {
        "company": "Sentry Insurance",
        "title": "Bilingual Customer Service Rep",
        "years": "April 2016 - July 2017",
        "description": "Made changes to customers policies such as adding and removing coverages, vehicles, and drivers. Provided excellent customer care for customers through the insurance process all via phone and email. Trained to assist other agents to provide exceptional customer service and excel in customer de-escalation."
      }
    ],
    "skills": [
      {
        "name": "Python",
        "level": "55%"
      },
      {
        "name": "ReactJS",
        "level": "50%"
      },
      {
        "name": "SQL",
        "level": "50%"
      },
      {
        "name": "Excel",
        "level": "80%"
      },
      {
        "name": "Tableau & Power BI",
        "level": "60%"
      },
      {
        "name": "Google Cloud Platform & Amazon Web Services",
        "level": "45%"
      },
      {
        "name": "Git",
        "level": "55%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Data Analytics Fundamentals",
        "category": "Amazon Certificate of completion",
        "image": "aws_cert.jpg",
        "url": "https://explore.skillbuilder.aws/learn/course/external/view/elearning/44/data-analytics-fundamentals"
      },
      {
        "title": "My Pytorch Notebook",
        "category": "Repo of my Pytorch Notebook",
        "image": "pytorch_nb.png",
        "url": "https://github.com/KevinGastelum/MyPytorchDeepDive"
      },
      {
        "title": "My Machine Learning Projects",
        "category": "Repo of my Machine Learning projects",
        "image": "MLProjects.png",
        "url": "https://github.com/KevinGastelum/Kev_MachineLearning"
      },
      {
        "title": "My React.JS Website",
        "category": "My Personal Website",
        "image": "resume-website.jpg",
        "url": "http://kevin.lovestoblog.com/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here is where I should write something nice someone said about me..",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "This Kevin Gastelum kid must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of College and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}

